tests-integration/cases_solved/02_DECAY/01_tewn_2022-Incompressible-tewn_2022_ref33/constant/transportProperties
FoamFile {
    version 2.0;
    format ascii;
    class dictionary;
    object transportProperties;
}
transportModel Newtonian;
nu nu [ 0 2 -1 0 0 0 0 ] 9.3379e-07;
rhoRef 997.33;
