tests-integration/cases_solved/02_DECAY/01_tewn_2022-Incompressible-tewn_2022_ref33/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2112                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    face1
    {
        type            flowRateInletVelocity;
        volumetricFlowRate constant 0.000175;
        value           nonuniform List<vector> 
138
(
(1.893440235 0 0)
(1.893440235 0 0)
(1.893440235 0 0)
(1.893440235 0 0)
(1.893440235 0 0)
(1.893440235 0 0)
(1.893440235 0 0)
(1.893440235 0 0)
...
)
;
    }
    face2
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           uniform (0 0 0);
    }
    face3
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }
    face4
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }
    face5
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }
    face6
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }
    face7
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
