tests-integration/cases_solved/02_DECAY/01_tewn_2022-Incompressible-tewn_2022_ref33/system/decomposeParDict
FoamFile {
    version 2.0;
    format ascii;
    class dictionary;
    object decomposeParDict;
}
method scotch;
numberOfSubdomains 2;
